Repository: bi1101/ielts-science-lms
Catalog: languages/ielts-science-lms-*.po
Languages: vi

source: %s page created successfully!
vi: Trang %s đã được tạo thành công!

source: - Select a page -
vi: - Chọn một trang -

source: A clear overview with main trends or differences
vi: Đoạn tổng quan rõ ràng với các xu hướng hoặc khác biệt chính

source: A mix of simple and multi-clause sentences; limited flexibility, complex structures are less accurate
vi: Có sự kết hợp giữa các câu đơn giản và câu phức; tính linh hoạt hạn chế, các cấu trúc phức tạp ít chính xác hơn

source: A relevant overview is attempted
vi: Đã có cố gắng viết đoạn tổng quan phù hợp

source: A variety of structures is used with SOME flexibility
vi: Một số các cấu trúc được sử dụng với sự linh hoạt NHẤT ĐỊNH

source: A very limited range of structures is used, only single clause sentences
vi: Số cấu trúc sử dụng rất hạn chế, chỉ có các câu đơn

source: A wide range of structures is flexibly and accurately used
vi: Một loạt các cấu trúc được sử dụng linh hoạt và chính xác

source: Accuracy
vi: Chính xác

source: Accurate and relevant data
vi: Dữ liệu chính xác và phù hơp

source: Add your own feedback
vi: Tự thêm nhận xét

source: Adequate resources, some repetition & few paraphrasing
vi: Vốn từ đủ, đôi khi lặp từ và ít paraphrasing

source: Advanced Grammar Correction
vi: Sửa ngữ pháp nâng cao

source: ALL parts of the question are answered
vi: TẤT CẢ các phần của câu hỏi đã dc trả lời

source: Already have an account?
vi: Đã có tài khoản?

source: Already have an account?
vi: Đã có tài khoản?

source: An error occurred. Please try again.
vi: Đã xảy ra lỗi. Vui lòng thử lại.

source: Analyze your essay now!
vi: Chấm bài ngay!

source: Analyzing
vi: Đang phân tích

source: Answers are not exact to the requirement
vi: Câu trả lời không hoàn toàn chính xác với đề bài

source: API Max Concurrent Requests
vi: Yêu cầu Đồng thời Tối đa của API

source: API Settings
vi: Cài đặt API

source: Appropriate format
vi: Định dạng phù hợp

source: Appropriate format, data are appropriately categorized
vi: Định dạng phù hợp, dữ liệu được phân loại một cách thích hợp

source: Appropriately use data
vi: Sử dụng dữ liệu một cách thích hợp

source: Argument Enhancement
vi: Nâng cấp lập luận

source: Associate a WordPress page with each of the following pages.
vi: Liên kết một trang WordPress với mỗi trang sau đây.

source: At least one Handwritten image is required*
vi: Cần ít nhất một hình ảnh viết tay*

source: Audio Transcription
vi: Chuyển đổi âm thanh thành văn bản

source: Brief Overview
vi: Tóm tắt ngắn

source: Bulk Feedback
vi: Nhận xét hàng loạt

source: By continuing, you agree to our Terms of Service and Privacy Policy
vi: Bằng cách tiếp tục, bạn đồng ý với Điều khoản Dịch vụ và Chính sách Bảo mật của chúng tôi

source: Cancel
vi: Hủy

source: Categories
vi: Danh mục

source: Chart
vi: Biểu đồ

source: Checkout
vi: Thanh toán

source: Clear answer
vi: Câu trả lời rõ ràng

source: Clear Answer/Clear Opinion
vi: Câu trả lời rõ ràng / Ý kiến rõ ràng

source: Clear position
vi: Lập trường rõ ràng

source: Clear Position/Answer
vi: Lập trường/Câu trả lời rõ ràng

source: Clear structure, not all paragraphs have a clear purpose
vi: Cấu trúc rõ ràng, không phải tất cả các đoạn văn đều có mục đích rõ ràng

source: close
vi: đóng

source: Coherence & Cohesion
vi: Sự mạch lạc và liên kết

source: Coherence & Cohesion Feedback
vi: Nhận xét về sự mạch lạc và liên kết

source: Conclusion - Rewrite
vi: Kết luận - Viết lại

source: Configure sample result links for the Writing Module.
vi: Cấu hình liên kết kết quả mẫu cho Module Writing.

source: Configure sample result links that will be available in front-end applications.
vi: Cấu hình liên kết kết quả mẫu sẽ có sẵn trong các ứng dụng giao diện người dùng.

source: Configure the API settings for IELTS Science LMS.
vi: Cấu hình cài đặt API cho IELTS Science LMS.

source: Contain irrelevant details
vi: Chứa chi tiết không liên quan

source: Contain lack-of-focus details
vi: Chứa các chi tiết hơi lạc đề

source: Contain less relevant details
vi: Chứa ít chi tiết ít liên quan vs đề

source: Contain overgeneralized details
vi: Chứa các chi tiết quá khái quát

source: Copied
vi: Đã sao chép

source: Copy Link
vi: Sao chép liên kết

source: Copy share link
vi: Sao chép liên kết chia sẻ

source: Corrected Sample Essay
vi: Bài sửa mẫu

source: Corrected Sample Speech
vi: Bài sửa mẫu

source: Could be improved
vi: Có thể cải thiện

source: Create a free account to get started
vi: Tạo tài khoản miễn phí để chấm bài

source: Create Page
vi: Tạo Trang

source: Creating...
vi: Đang tạo...

source: Detailed Scoring Evaluation
vi: Chấm chi tiết 4 tiêu chí

source: Don't have an account?
vi: Chưa có tài khoản?

source: Don't have an account?
vi: Chưa có tài khoản?

source: Download JSON
vi: Tải xuống JSON

source: Edit Suggestion
vi: Sửa nhận xét

source: Effective paragraphing
vi: Chia đoạn hiệu quả

source: Email or Username
vi: Email hoặc Tên người dùng

source: Enter question
vi: Nhập đề bài

source: Enter your essay
vi: Nhập bài làm của bạn

source: Error creating %1$s page: %2$s
vi: Lỗi khi tạo trang %1$s: %2$s

source: Error loading cart
vi: Lỗi khi tải giỏ hàng

source: Error loading essays:
vi: Lỗi tải bài viết:

source: Errors FREQUENTLY impede meaning
vi: Lỗi THƯỜNG XUYÊN ảnh hưởng ý nghĩa

source: Errors impede meaning
vi: Lỗi làm ảnh hưởng ý nghĩa

source: Essay is required
vi: Vui lòng nhập bài làm

source: Essay not found
vi: Không tìm thấy bài luận

source: EVALUATE
vi: CHẤM BÀI

source: Evaluate and correct handwritten IELTS Writing Task 1
vi: Chấm và nhận xét IELTS Writing Task 1 viết tay

source: Evaluate and correct handwritten IELTS Writing Task 2
vi: Chấm và nhận xét IELTS Writing Task 2 viết tay

source: Evaluate and correct IELTS Writing Task 1
vi: Chấm và nhận xét IELTS Writing Task 1

source: Evaluate and correct IELTS Writing Task 2
vi: Chấm và nhận xét IELTS Writing Task 2

source: Evaluate IELTS Speaking x GPT
vi: Chấm IELTS Speaking x GPT

source: Evaluate IELTS Writing x GPT
vi: Chấm IELTS Writing x GPT

source: Evaluation History
vi: Lịch sử bài chấm

source: Export as GDocs
vi: Xuất GDocs

source: Export as Word
vi: Xuất file Word

source: Export to GDocs/Word
vi: Xuất ra GDocs/Word

source: Extended and supported
vi: Được phát triển và chứng minh

source: Extended and supported, but overgeneralized, lack focus or precision
vi: Được phát triển và chứng minh, nhưng còn chung chung, thiếu tập trung hoặc chưa chính xác

source: Fair
vi: Ổn

source: Feedback
vi: Nhận xét

source: Feedback by
vi: Nhận xét bởi

source: Feedback Languague
vi: Ngôn ngữ nhận xét

source: Feedback Style
vi: Văn phong nhận xét

source: Few errors, NEVER impede meaning
vi: Ít lỗi, KHÔNG BAO GIỜ ảnh hưởng ý nghĩa

source: Few key features are selected, and they are irrelevant or repetitive
vi: Một vài chi tiết chính được chọn, nhưng không liên quan hoặc lặp lại

source: Few minor errors in style and collocation. No word choice errors
vi: Một vài lỗi nhỏ về phong cách và collocation. Không có lỗi chọn từ

source: File name
vi: Tên file

source: Flow
vi: Mạch văn

source: For Teachers only
vi: Chỉ dành cho giáo viên

source: Format
vi: Định dạng

source: Format may be inappropriate in places
vi: Định dạng có thể không phù hợp ở một số nơi

source: Frequent errors & SOMETIMES impede meaning
vi: Lỗi thường xuyên và ĐÔI KHI cản trở ý nghĩa

source: Frequent errors, not affecting comprehension
vi: Lỗi thường xuyên, không ảnh hưởng đến ý nghĩa

source: Full Explanation
vi: Giải thích chi tiết

source: Get feedback from a certified teacher
vi: Nhận nhận xét từ một giáo viên có chứng chỉ

source: Get Pro Feedback
vi: Nhận nhận xét chuyên nghiệp

source: Give a sample of your usual feedback to help the AI learn your tone. This will not affect the scores.
vi: Hãy đưa ra một ví dụ về nhận xét thông thường của bạn để giúp AI học văn phong của bạn. Điều này sẽ không ảnh hưởng đến điểm số.

source: Good
vi: Tốt

source: Google Login
vi: Đăng nhập Google

source: Grammar Feedback
vi: Nhận xét ngữ pháp

source: Grammar Suggestions
vi: Gợi ý ngữ pháp

source: Handwriting Text Recognition
vi: Nhận diện chữ viết tay

source: Hard to discern answer
vi: Khó để nhận ra câu trả lời

source: Hard to discern position
vi: Khó phân biệt lập trường

source: Has a position directly answering the question
vi: Có quan điểm trả lời trực tiếp câu hỏi

source: Idea arrangement causes confusion
vi: Sự sắp xếp ý tưởng gây ra sự khó hiểu

source: Idea Development
vi: Phát triển ý tưởng

source: Ideas are connected flawlessly
vi: Các ý tưởng được liên kết một cách hoàn hảo

source: Ideas are logically connected; minor paragraph-level disruptions or considerable sentence-level disruptions
vi: Các ý tưởng được kết nối một cách logic; có sự gián đoạn nhỏ ở cấp độ đoạn văn hoặc sự gián đoạn đáng kể ở cấp độ câu

source: Ideas are logically connected; minor sentence-level disruptions
vi: Các ý tưởng được kết nối một cách logic; có những gián đoạn nhỏ ở cấp độ câu

source: Ideas recognizable but not logically connected
vi: Phân chia ý tưởng rõ nhưng không được kết nối một cách logic

source: IELTS Science Audio Transcription
vi: Chuyển đổi âm thanh thành văn bản của IELTS Science

source: IELTS Science Learning Management System.
vi: Hệ thống Quản lý Học tập IELTS Science.

source: IELTS Science LMS Settings
vi: Cài đặt IELTS Science LMS

source: Impact
vi: Ảnh hưởng

source: Improved Essay
vi: Bài sửa mẫu

source: Inaccurate data
vi: Dữ liệu không chính xác

source: Inadequate & inaccurate referencing causes frequent repetition
vi: Ít sử dụng referencing và chưa chính xác gây ra sự lặp từ thường xuyên

source: Inappropriate format
vi: Định dạng không phù hợp

source: Include a brief overview of main points
vi: Có tổng quan ngắn gọn về các luận điểm chính

source: Insufficiently developed or lack clarity
vi: Phát triển không đầy đủ hoặc thiếu rõ ràng

source: Insufficiently developed, containing unclear detail
vi: Phát triển chưa đầy đủ, chứa chi tiết không rõ ràng

source: Introduction - Rewrite
vi: Mở bài - Viết lại

source: Invalid page key or module name.
vi: Khóa trang hoặc tên module không hợp lệ.

source: Key features are adequately covered, some missing or excessive details
vi: Các đặc điểm chính được đề cập đầy đủ, một số chi tiết bị thiếu hoặc thừa

source: Key features are covered, and clearly highlighted, but could be further extended
vi: Các đặc điểm chính được đề cập và làm nổi bật rõ ràng, nhưng có thể được mở rộng thêm

source: Key features are not adequately covered, irrelevant or mechanically recounted
vi: Các đặc điểm chính không được đề cập đầy đủ, không liên quan hoặc được kể lại một cách máy móc

source: Key features are skillfully selected and clearly highlighted
vi: Các đặc điểm chính được chọn lọc một cách khéo léo và được làm nổi bật rõ ràng

source: Language
vi: Ngôn ngữ

source: Lexical Resources Feedback
vi: Nhận xét từ vựng

source: Limited and inadequate, frequent repetition, no paraphrasing
vi: Hạn chế và chưa đủ, lặp từ thường xuyên, không paraphrase

source: Limited and minimally adequate, frequent repetition
vi: Hạn chế và chỉ gần đủ, lặp từ thường xuyên

source: Limited/overuse and frequent inaccurate use
vi: Sử dụng hạn chế/quá mức và thường xuyên sử dụng không chính xác

source: Link
vi: Liên kết

source: Link copied
vi: Liên kết đã được sao chép

source: Linking
vi: Liên kết

source: Little to no development, containing irrelevant or illogical detail
vi: Ít hoặc không có sự phát triển ý, chứa chi tiết không liên quan hoặc không logic

source: Little to no development, may contain illogical detail
vi: Ít hoặc không có sự phát triển ý, có thể chứa chi tiết phi lý

source: Log in to access your account
vi: Đăng nhập để truy cập tài khoản của bạn

source: Logging in...
vi: Đang đăng nhập...

source: Logic & Depth
vi: Logic & Chiều sâu

source: Login
vi: Đăng nhập

source: Login failed. Please check your credentials.
vi: Đăng nhập thất bại. Vui lòng kiểm tra thông tin đăng nhập của bạn.

source: Login with Google
vi: Đăng nhập bằng Google

source: Main Point - Rewrite
vi: Luận điểm chính - Viết lại

source: Maximum number of concurrent API requests allowed.
vi: Số lượng yêu cầu API đồng thời tối đa được phép.

source: Minimal & inaccurate use of referencing
vi: Ít sử dụng referencing và không chính xác

source: Missing paragraph
vi: Thiếu đoạn

source: Mostly accurate & flexible use, not mechanical
vi: Sử dụng phần lớn đã chính xác và linh hoạt, không máy móc

source: My student's name - IELTS Task 2 Result
vi: Tên học sinh của tôi - Kết quả Bài viết IELTS Task 2

source: Needs work
vi: Cần cải thiện

source: New Vocabulary
vi: Từ vựng mới

source: New Vocabulary Table
vi: Bảng Từ Vựng Mới

source: No data
vi: Không có dữ liệu

source: No discernable answer
vi: Không có câu trả lời rõ ràng

source: No discernable position
vi: Không có lập trường rõ ràng

source: No essays found for this type. Try submitting one first!
vi: Không tìm thấy bài luận nào cho loại này. Hãy thử nộp một bài trước!

source: No identifiable paragraphing
vi: Không có đoạn văn rõ ràng

source: No OCR images available. Please upload handwritten images to use this feature.
vi: Không có hình ảnh bài viết tay nào có sẵn. Vui lòng tải lên hình ảnh viết tay để sử dụng tính năng này.

source: No overgeneralization
vi: Không khái quát hóa quá mức

source: No overview of main points
vi: Không có tổng quan về các luận điểm chính

source: No overview, only focus on details
vi: Không có đoạn tổng quan, chỉ tập trung vào chi tiết

source: No paragraphing or all paragraphs lack a clear purpose
vi: Không có đoạn văn hoặc tất cả các đoạn văn đều thiếu mục đích rõ ràng

source: No sample results are currently configured. Modules can add their own sample result sections through the filter.
vi: Hiện không có kết quả mẫu nào được cấu hình. Các module có thể thêm phần kết quả mẫu của riêng mình thông qua bộ lọc.

source: No transcription data available for this audio file.
vi: Không có dữ liệu chuyển đổi nào cho tệp âm thanh này.

source: No usage of uncommon vocab
vi: Không sử dụng từ vựng ít phổ biến

source: Not exact to the question
vi: Chưa chính xác với đề bài

source: Occasional error in word choice, collocation and informal language
vi: Hiếm lỗi chọn từ, collocation và ngôn ngữ không trang trọng

source: OR
vi: HOẶC

source: or drag and drop image here
vi: hoặc kéo và thả hình ảnh vào đây

source: Overgeneralize
vi: Khái quát hóa quá mức

source: Page created successfully!
vi: Trang đã được tạo thành công!

source: Page title not found for the given key and module.
vi: Không tìm thấy tiêu đề trang cho khóa và module đã cho.

source: Pages
vi: Các trang

source: Pages Settings
vi: Cài đặt Trang

source: Paragraphing
vi: Chia đoạn

source: Password
vi: Mật khẩu

source: Perfect use
vi: Sủ dụng hoàn hảo

source: Please enter both username and password
vi: Vui lòng nhập cả tên người dùng và mật khẩu

source: Present an Overview
vi: Trình bày đoạn tổng quan

source: Present Key Features
vi: Trình bày các đặc điểm chính

source: Processing
vi: Đang xử lý

source: Processing your handwritten text...
vi: Đang xử lý văn bản viết tay của bạn...

source: Provide your feedback sample in Vietnamese.
vi: Cung cấp mẫu nhận xét của bạn bằng tiếng Việt.

source: Question is required
vi: Vui lòng nhập đề bài

source: Range of Structures
vi: Sự đa dạng cấu trúc

source: Range of Vocabulary
vi: Sự đa dạng từ vựng

source: Rare, non-systematic errors, NEVER impede meaning
vi: Ít lỗi, lỗi không hệ thống, KHÔNG cản trở ý nghĩa

source: Regenerate feedback with your suggestion.
vi: Tạo lại phản hồi với đề xuất của bạn.

source: Relevance
vi: Chặt chẽ với đề bài

source: Remember me
vi: Lưu mật khẩu

source: Remove item
vi: Bỏ mục

source: Requires attention
vi: Cần chú ý

source: requires WordPress version 6.0 or higher. The plugin has been deactivated.
vi: yêu cầu phiên bản WordPress 6.0 trở lên. Plugin đã bị vô hiệu hóa.

source: Result Task 1
vi: Kết quả Bài 1

source: Result Task 2
vi: Kết quả Bài 2

source: Sample Essay
vi: Bài mẫu

source: Sample Feedback (VI)
vi: Mẫu nhận xét (VI)

source: Sample Result Icon
vi: Biểu tượng Kết quả Mẫu

source: Sample Results
vi: Bài mẫu

source: Sample Results Settings
vi: Cài đặt Kết quả Mẫu

source: Save
vi: Lưu

source: Security check failed.
vi: Kiểm tra bảo mật thất bại.

source: Select Chart Image
vi: Chọn ảnh biểu đồ

source: Select Handwritten Image
vi: Chọn ảnh bài viết tay

source: Select or type categories
vi: Chọn hoặc nhập loại lỗi

source: Select Score
vi: Chọn điểm

source: Select the pages for the Speaking Module.
vi: Chọn các trang cho Module Nói.

source: Select the pages for the Writing Module.
vi: Chọn các trang cho Module Viết.

source: Settings
vi: Cài đặt

source: settings
vi: cài đặt

source: Share
vi: Chia sẻ

source: Share Result
vi: Chia sẻ kết quả

source: Shopping Cart
vi: Giỏ hàng

source: Sign up
vi: Đăng kí

source: Sign up with Google
vi: Đăng ký bằng Google

source: Skillfully used, no lapse
vi: Sử dụng thành thạo, không có sai sót

source: Some errors, not affecting comprehension
vi: Một số lỗi, không ảnh hưởng đến ý nghĩa

source: Some errors, RARELY impede meaning
vi: Một số lỗi, HIẾM KHI cản trở ý nghĩa

source: Some good use, but some grammar errors; mechanical use
vi: Một số nơi sử dụng tốt, nhưng còn lỗi ngữ pháp; sử dụng máy móc

source: Some lapses
vi: Một vài sai sót

source: SOME parts of the question are NOT answered
vi: MỘT SỐ phần của câu hỏi KHÔNG được trả lời

source: Some use of basic devices inaccurately or repetitively
vi: Đã sử dụng một số phép nối cơ bản nhưng chưa chính xác hoặc lặp lại

source: Speaking APIs
vi: API Nói

source: Speaking APIs Process Order
vi: Thứ tự xử lý API Nói

source: Speaking History
vi: Lịch sử bài Speaking

source: Speaking Module Pages
vi: Các trang Module Nói

source: Speaking Results
vi: Kết quả Nói

source: Speech not found
vi: Không tìm thấy bài nói

source: Spelling errors always impede meaning
vi: Lỗi chính tả luôn cản trở ý nghĩa

source: Spelling mistakes never impede meaning, few errors
vi: Lỗi chính tả không bao giờ cản trở ý nghĩa, ít lỗi

source: Spelling mistakes never impede meaning, several errors
vi: Lỗi chính tả không bao giờ cản trở ý nghĩa, nhiều lỗi

source: Spelling mistakes never impede meaning, some errors
vi: Lỗi chính tả không bao giờ cản trở ý nghĩa, một số lỗi

source: Spelling sometimes impedes meaning
vi: Chính tả đôi khi cản trở ý nghĩa

source: Spelling, Word Form Error
vi: Lỗi chính tả, lỗi dạng từ

source: Submit
vi: Gửi

source: Submitted by
vi: Gửi bởi

source: Subtotal:
vi: Tổng phụ:

source: Sufficient resource to allow flexibility, not repetitive
vi: Vốn từ đủ để sử dụng linh hoạt, không lặp từ

source: Suggested Text
vi: Văn bản gợi ý

source: Task 1 Essay
vi: Bài làm Task 1

source: TASK 1 Handwritten
vi: TASK 1 Viết tay

source: Task 1 Question
vi: Đề bài Task 1

source: Task 2 Essay
vi: Bài làm Task 2

source: TASK 2 Handwritten
vi: TASK 2 Viết tay

source: Task 2 Question
vi: Đề bài Task 2

source: Task Achievement Feedback
vi: Nhận xét Task Achievement

source: Task Response
vi: Phản hồi Bài tập

source: Task Response Feedback
vi: Nhận xét Task Response

source: Text Recognition Complete
vi: Nhận diện văn bản hoàn tất

source: The data has been misunderstood
vi: Dữ liệu đã bị hiểu sai

source: The prompt has been misunderstood
vi: Đề bài đã bị hiểu sai

source: The question has been misunderstood
vi: Câu hỏi đã bị hiểu sai

source: The range of structures is limited and repetitive; some multi-clause sentences are used
vi: Độ rộng cấu trúc còn hạn chế và lặp lại; một số câu có nhiều mệnh đề được sử dụng

source: Thinking
vi: Đang tư duy

source: This data is used by the IELTS Science Speaking module to display word-by-word transcription.
vi: Dữ liệu này được sử dụng bởi module Nói của IELTS Science để hiển thị bản phiên âm từng từ một.

source: This field displays the transcript data for this audio file in read-only format.
vi: Trường này hiển thị dữ liệu bản phiên âm cho tệp âm thanh này ở dạng chỉ đọc.

source: This option open result page in new tabs helping teachers grade multiple essays simultaneously.
vi: Tùy chọn này mở trang kết quả trong tab mới, giúp giáo viên chấm điểm nhiều bài luận cùng lúc.

source: To modify this data, use the IELTS Science Speaking API endpoints.
vi: Để sửa đổi dữ liệu này, hãy sử dụng các điểm cuối API Nói của IELTS Science.

source: Topic Sentence - Rewrite
vi: Câu chủ đề - Viết lại

source: Transcript contains IDs that are not in the audio_ids list: %s
vi: Bản phiên âm chứa các ID không có trong danh sách audio_ids: %s

source: Try Again
vi: Thử lại

source: Unclear referencing causes some repetition & misunderstanding
vi: Referencing không rõ ràng, đôi khi gây lặp từ và hiểu lầm

source: Uncommon vocab does not impede comprehension, occasional unnatural usage
vi: Từ vựng ít phổ biến không cản trở nghĩa câu, hiếm khi sử dụng không tự nhiên

source: Uncommon vocab does not impede comprehension, some unnatural usage
vi: Từ vựng ít phổ biến không cản trở nghĩa câu, đôi khi sử dụng không tự nhiên

source: Uncommon vocab may not be appropriate
vi: Từ vựng ít phổ biến có thể không phù hợp

source: Uncommon/Topical Vocabulary
vi: Từ vựng ít phổ biến/theo chủ đề

source: Unknown error
vi: Lỗi không xác định

source: Upload Chart Images
vi: Tải lên ảnh biểu đồ

source: Upload Handwritten Images
vi: Tải lên ảnh bài viết tay

source: Upload OCR Images
vi: Tải lên ảnh bài viết tay

source: URL to a sample General Essay result page. Will be available in front-end apps.
vi: URL đến trang kết quả Bài luận Tổng quát mẫu. Sẽ có sẵn trong các ứng dụng front-end.

source: URL to a sample Task 1 result page. Will be available in front-end apps.
vi: URL đến trang kết quả Bài 1 mẫu. Sẽ có sẵn trong các ứng dụng front-end.

source: URL to a sample Task 2 result page. Will be available in front-end apps.
vi: URL đến trang kết quả Bài 2 mẫu. Sẽ có sẵn trong các ứng dụng front-end.

source: Use Data
vi: Sử dụng dữ liệu

source: Use Data Accurately
vi: Sử dụng dữ liệu chính xác

source: Use of Cohesive Devices
vi: Sử dụng phép nối

source: Vietnamese
vi: Tiếng Việt

source: Vietnamese Feedback Sample
vi: Mẫu nhận xét tiếng Việt

source: View Cart
vi: Xem giỏ hàng

source: View details
vi: Xem chi tiết

source: View Page
vi: Xem Trang

source: View Result
vi: Xem kết quả

source: View sample result
vi: Xem bài mẫu

source: Vocabulary Suggestions
vi: Gợi ý từ vựng

source: Warning: The transcription data is not valid JSON. Error: %s
vi: Cảnh báo: Dữ liệu phiên âm không phải là JSON hợp lệ. Lỗi: %s

source: Welcome Back!
vi: Chào mừng trở lại

source: Well extended and supported
vi: Phát triển và chứng minh tốt

source: Wide resources, flexible use, and precise meaning
vi: Vốn từ phong phú, sử dụng linh hoạt và chính xác

source: Word choice, Collocation, Style
vi: Chọn từ hợp văn cảnh, Collocation, Văn phong

source: Write a brief feedback
vi: Viết nhận xét ngắn

source: Writing APIs
vi: API Viết

source: Writing APIs Process Order
vi: Thứ tự xử lý API Viết

source: Writing General Essay Sample Result
vi: Kết quả Mẫu Bài luận Tổng quát Viết

source: Writing Module Pages
vi: Các trang Module Viết

source: Writing Module Sample Results
vi: Kết quả Mẫu Module Viết

source: Writing Task 1 Sample Result
vi: Kết quả Mẫu Bài 1 Viết

source: Writing Task 2 Sample Result
vi: Kết quả Mẫu Bài 2 Viết

source: You are probably offline.
vi: Có lẽ bạn đang ngoại tuyến.

source: You can edit the recognized text below before submitting
vi: Bạn có thể chỉnh sửa văn bản đã nhận dạng bên dưới trước khi gửi

source: You do not have sufficient permissions to access this page.
vi: Bạn không có quyền truy cập trang này.

source: Your cart is empty
vi: Giỏ hàng của bạn đang trống

source: Your essay text...
vi: Bài luận của bạn...
